# Handling Categorical Missing Values in Python

***Categorical variables*** are a type of variable used in statistics and data science to represent qualitative or nominal data. These variables can be defined as a class or category of data that cannot be quantified continuously, but only discretely.

>For example, an example of a categorical variable might be a person’s eye color, which can be blue, green, or brown.

>>*Most learning models don’t work with data in a categorical format. We must first convert them into numeric format so that the information is preserved.*

>***Categorical variables can be classified into two types:***
>> - Nominal
>> - Ordinal

>**Nominal variables** are variables that are not constrained by a precise order. Gender, color, or brands are examples of nominal variables since they are not sortable.

>**Ordinal variables** are instead categorical variables divided into logically orderable levels. A column in a dataset that consists of levels such as First, Second, and Third can be considered an ordinal categorical variable.

>***You can go deeper into the breakdown of categorical variables by considering binary and cyclic variables.***

>> - **A binary variable** is simple to understand: it is a categorical variable that can only take on two values.

>> - **A cyclic variable**, on the other hand, is characterized by a repetition of its values. For example, the days of the week are cyclical, and so are the seasons.

# Libraries

In [1]:
# Handling data structures
import pandas as pd
import numpy as np

# Detecting and visualizing missing values
import missingno as msno

# Removing warnings
import warnings

# Missing value univariate imputer
from sklearn.impute import SimpleImputer

# Missing values multivariate imputer
from sklearn.experimental import enable_iterative_imputer
from sklearn.impute import IterativeImputer

# Dataset

We are going to use loan model dataset with both numerical and categorical variable emulating real word data problems, The data link will be shared with trainees

In [2]:
loan_data = pd.read_csv("C:/Users/ADMIN/Documents/PYTHON BLOG DATA AND NOTEBOOKS/Data cleaning/" + 
"Handling missing values/datasets/train_ctrUa4K.csv")

## Show first few rows

In [3]:
loan_data.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

## See the shape of the data

In [4]:
loan_data.shape

(614, 13)

## Get categorical variables and create data

In [5]:
# Categorical variables can be presented as categorical strings or coded as numbers (nominal)
# Lets look for coded categorical variable
# An example is a variable with min of 0 and maximum of 1
# Lets get the list of such variables
# Get the dataset of coded categorical variables
print("=========================================================================================")
# First we need to get numerical variable
# Listing numerical data
numerical_variables = list(loan_data.select_dtypes(include=[np.number]).columns.values)
print(numerical_variables)
print("=========================================================================================")
loan_data_numerical = loan_data.select_dtypes(include=[np.number])
print(loan_data_numerical)
print("=========================================================================================")
# We can see that credit history is a coded categorical data
coded_categorical_data=loan_data_numerical.loc[:,[(loan_data_numerical[col].max() == 1)
                                                   for col in loan_data_numerical.columns]]
print(coded_categorical_data)
print("=========================================================================================")
# Get the list of coded categorical variables
coded_categorical_variables =list(coded_categorical_data.columns.values)
print(coded_categorical_variables)
print("=========================================================================================")

=========================================================================================
['ApplicantIncome', 'CoapplicantIncome', 'LoanAmount', 'Loan_Amount_Term', 'Credit_History']
=========================================================================================
     ApplicantIncome  CoapplicantIncome  LoanAmount  Loan_Amount_Term  \
0               5849                0.0         NaN             360.0
1               4583             1508.0       128.0             360.0
2               3000                0.0        66.0             360.0
3               2583             2358.0       120.0             360.0
4               6000                0.0       141.0             360.0
..               ...                ...         ...               ...
609             2900                0.0        71.0             360.0
610             4106                0.0        40.0             180.0
611             8072              240.0       253.0             360.0
612             7583                0.0       187.0             360.0
613             4583                0.0       133.0             360.0

     Credit_History
0               1.0
1               1.0
2               1.0
3               1.0
4               1.0
..              ...
609             1.0
610             1.0
611             1.0
612             1.0
613             0.0

[614 rows x 5 columns]
=========================================================================================
     Credit_History
0               1.0
1               1.0
2               1.0
3               1.0
4               1.0
..              ...
609             1.0
610             1.0
611             1.0
612             1.0
613             0.0

[614 rows x 1 columns]
=========================================================================================
['Credit_History']
=========================================================================================

In [6]:
# We have listed coded categorical variables
# Now, we wanna list non-coded categorical variable
# Non-coded categorical variables
print("=========================================================================================")
none_coded_categorical_variables = list(loan_data.select_dtypes(exclude=[np.number]).columns.values)
print(none_coded_categorical_variables)
print("=========================================================================================")

# having coded categorical variable, we can create total categorical variables
total_categorical_variables = none_coded_categorical_variables+coded_categorical_variables
print(total_categorical_variables)
print("=========================================================================================")

# having total categorical variables, we can create total categorical data
total_categorical_data = loan_data[total_categorical_variables]
print(total_categorical_data)
print("=========================================================================================")

=========================================================================================
['Loan_ID', 'Gender', 'Married', 'Dependents', 'Education', 'Self_Employed', 'Property_Area', 'Loan_Status']
=========================================================================================
['Loan_ID', 'Gender', 'Married', 'Dependents', 'Education', 'Self_Employed', 'Property_Area', 'Loan_Status', 'Credit_History']
=========================================================================================
      Loan_ID  Gender Married Dependents     Education Self_Employed  \
0    LP001002    Male      No          0      Graduate            No
1    LP001003    Male     Yes          1      Graduate            No
2    LP001005    Male     Yes          0      Graduate           Yes
3    LP001006    Male     Yes          0  Not Graduate            No
4    LP001008    Male      No          0      Graduate            No
..        ...     ...     ...        ...           ...           ...
609  LP002978  Female      No          0      Graduate            No
610  LP002979    Male     Yes         3+      Graduate            No
611  LP002983    Male     Yes          1      Graduate            No
612  LP002984    Male     Yes          2      Graduate            No
613  LP002990  Female      No          0      Graduate           Yes

    Property_Area Loan_Status  Credit_History
0           Urban           Y             1.0
1           Rural           N             1.0
2           Urban           Y             1.0
3           Urban           Y             1.0
4           Urban           Y             1.0
..            ...         ...             ...
609         Rural           Y             1.0
610         Rural           Y             1.0
611         Urban           Y             1.0
612         Urban           Y             1.0
613     Semiurban           N             0.0

[614 rows x 9 columns]
=========================================================================================

## Check missing values in the categorical data

In [7]:
def create_missing_values_table(df):
        # Total missing values
        miss_val = df.isnull().sum()
        
        # Percentage of missing values
        miss_val_percent = 100 * df.isnull().sum() / len(df)
        
        # Make a table with the results
        miss_val_table = pd.concat([miss_val, miss_val_percent], axis=1)
        
        # Rename the columns
        miss_val_table_ren_columns = miss_val_table.rename(
        columns = {0 : 'Missing Values', 1 : '% of Total Values'})
        
        # Sort the table by percentage of missing descending
        miss_val_table_ren_columns = miss_val_table_ren_columns[
            miss_val_table_ren_columns.iloc[:,1] != 0].sort_values(
        '% of Total Values', ascending=False).round(1)
        
        # Print some summary information
        print ("Your selected dataframe has " + str(df.shape[1]) + " columns.\n"      
            "There are " + str(miss_val_table_ren_columns.shape[0]) +
              " columns that have missing values.")
        
        # Return the dataframe with missing information
        return miss_val_table_ren_columns

In [8]:
# Check total number of missing values in the entire dataset
total_categorical_data.isnull().sum().sum()

113

In [9]:
create_missing_values_table(total_categorical_data)

Your selected dataframe has 9 columns.
There are 5 columns that have missing values.

                Missing Values  % of Total Values
Credit_History              50                8.1
Self_Employed               32                5.2
Dependents                  15                2.4
Gender                      13                2.1
Married                      3                0.5

## Create a list of column with missing values

In [10]:
# List of categorical variables with missing values
cat_variables_with_missing_val = [var for var in total_categorical_data.columns if total_categorical_data[var].isnull().sum() > 0]
cat_variables_with_missing_val

['Gender', 'Married', 'Dependents', 'Self_Employed', 'Credit_History']

## Handling missing values

## There are several ways to handle missing values of categorical variables. Here are a few options:

- **Deletion** - We have discussed deletion as above. You may refer to them for assumptions and implementation in categorical variable. As there is no difference in what we have done with numerical variables. We are not going to repeat the procedures here.

- **Ignore the rows with missing values**: This is only a viable option if the number of rows with missing values is small compared to the total number of rows.

- **Impute the missing values**: This involves replacing the missing values with some other value, such as the mode (most frequent value) of the variable. This is a quick and easy option, but it may not always produce the best results.

- **Use a separate category for missing values**: This involves creating a new category specifically for missing values. This can be useful if the missing values have some meaningful interpretation.

- **Use multiple imputations**: This involves using advanced techniques to impute the missing values in a way that takes into account the uncertainty associated with the imputation. Multiple imputations can produce more accurate results than simple imputation, but it is also more complex and time-consuming.

Which option you choose will depend on the nature of your data and the goals of your analysis.

## a) Deletion
>
>>Deletion means to delete the missing values from a dataset. This is however not recommended as it might result in loss of information from the dataset. We should only delete the missing values from a dataset if their proportion is very small. Deletions are further of three types:

> ### i. Pairwise Deletion
>> Parwise Deletion is used when values are missing completely at random i.e MCAR. During Pairwise deletion, only the missing values are deleted. All operations in pandas like mean, sum etc intrinsically skip missing values. Since there is no need to sum or calculating average in categorical variables, this method is applicable only as we say, leave missing values missing.

>### ii. Listwise Deletion/ Dropping rows
>>> 
During Listwise deletion, complete rows(which contain the missing values) are deleted. As a result, it is also called Complete Case deletion. Like Pairwise deletion, listwise deletions are also only used for MCAR values.

>### Listwise deletion for a single column

In [11]:
# Create a copy of dataset
total_categorical_data_1 = total_categorical_data.copy()

# Drop rows which contains any NaN or missing value for Married column
total_categorical_data_1.dropna(subset=['Married'],how='any',inplace=True)
total_categorical_data_1['Married'].isnull().sum()

0

>The Married column doesn't have any missing values. A major diadvantage of Listwise deletion is that a major chunk of data is deleted and hence a lot of information is lost. Hence, it is advisable to use it only when the number of missing values is very small.

>### Listwise deletion for multiple columns with missing values

In [12]:
# With the above data, total_categorical_data_1
# Let us drop rows for any missing values in either column Gender or Dependents
total_categorical_data_1.dropna(subset=['Gender',"Dependents"],how='any',inplace=True)
print(total_categorical_data_1['Gender'].isnull().sum())
print(total_categorical_data_1["Dependents"].isnull().sum())
print(total_categorical_data_1["Self_Employed"].isnull().sum())

0
0
32

>### Listwise deletion for all columns with missing values

In [13]:
total_categorical_data_1_all = total_categorical_data_1.dropna()

In [14]:
create_missing_values_table(total_categorical_data_1_all)

Your selected dataframe has 9 columns.
There are 0 columns that have missing values.

Empty DataFrame
Columns: [Missing Values, % of Total Values]
Index: []

>### Listwise deletion for a row/s that meets a parameter in missing counts

In [15]:
# To demonstrate more on this, I have created a data set
# If a row has more than 3 missing values, delete that row
# This a small data for this practice and I have 3 columns that have more than 3 missing values
# Lets import the data and work

delete_row_with_cond = pd.read_csv("C:/Users/ADMIN/Documents/PYTHON BLOG DATA AND NOTEBOOKS/Data cleaning/" + 
"Handling missing values/notebooks/missing-values/demo-delete-rows-with-condition.csv")

In [16]:
# Show data
delete_row_with_cond

   Number Order Date Region_t_p Name_t_p Item_t_p  Units  Unit Cost   Total
0       1     1 6 19        NaN    Jones   Pencil   95.0       1.99  189.05
1       2    1 23 19        NaN   Kivell   Binder   50.0      19.99  999.50
2       3     2 9 19    Central      NaN      NaN    NaN        NaN  179.64
3       4    2 26 19    Central     Gill      Pen   27.0      19.99  539.73
4       5        NaN        NaN      NaN      NaN    NaN       2.99  167.44
5       7    4 18 19    Central  Andrews   Pencil   75.0       1.99  149.25
6       9        NaN        NaN      NaN      NaN    NaN       1.99   63.68
7      10     6 8 19       East    Jones   Binder   60.0       8.99     NaN

In [17]:
# The total rows and columns
delete_row_with_cond.shape

(8, 8)

In [18]:
# Check total number of missing values in the entire dataset
delete_row_with_cond.isnull().sum().sum()

17

In [19]:
# Total number of missing values in each column
create_missing_values_table(delete_row_with_cond)

Your selected dataframe has 8 columns.
There are 7 columns that have missing values.

            Missing Values  % of Total Values
Region_t_p               4               50.0
Name_t_p                 3               37.5
Item_t_p                 3               37.5
Units                    3               37.5
Order Date               2               25.0
Unit Cost                1               12.5
Total                    1               12.5

In [20]:
# For now, I am not interested in the percentage missing in columns as above
# I am interested in dropping the row that has missing in 50% and more of the columns
# That is drop a row if nan is 4 and above
# I am expecting 3 rows to be deleted and we remain with 5; 2,4 and 6 have to be deleted
delete_row_with_cond_1 = delete_row_with_cond[delete_row_with_cond.isnull().sum(axis=1) < 3]
delete_row_with_cond_1

   Number Order Date Region_t_p Name_t_p Item_t_p  Units  Unit Cost   Total
0       1     1 6 19        NaN    Jones   Pencil   95.0       1.99  189.05
1       2    1 23 19        NaN   Kivell   Binder   50.0      19.99  999.50
3       4    2 26 19    Central     Gill      Pen   27.0      19.99  539.73
5       7    4 18 19    Central  Andrews   Pencil   75.0       1.99  149.25
7      10     6 8 19       East    Jones   Binder   60.0       8.99     NaN

In [21]:
# Another way to handle this is by using threshold parameter in dropna function.
delete_row_with_cond_2 = delete_row_with_cond.dropna(thresh=delete_row_with_cond.shape[1]-3, axis=0)
delete_row_with_cond_2

   Number Order Date Region_t_p Name_t_p Item_t_p  Units  Unit Cost   Total
0       1     1 6 19        NaN    Jones   Pencil   95.0       1.99  189.05
1       2    1 23 19        NaN   Kivell   Binder   50.0      19.99  999.50
3       4    2 26 19    Central     Gill      Pen   27.0      19.99  539.73
5       7    4 18 19    Central  Andrews   Pencil   75.0       1.99  149.25
7      10     6 8 19       East    Jones   Binder   60.0       8.99     NaN

>### iii. Dropping complete columns
>> If a column contains a lot of missing values, say more than 80%, and the feature is not significant, you might want to delete that feature. However, again, it is not a good methodology to delete data.

>> This is not useful in our case for example as both loan amount and loan tearms are very important features to consider.

In [22]:
# Here you first need to list all the columns with missing values
cat_variables_with_missing_val

['Gender', 'Married', 'Dependents', 'Self_Employed', 'Credit_History']

In [23]:
# Delete one of this column
total_categorical_data_5 = total_categorical_data.drop(['Gender'],axis=1)
total_categorical_data_5.isnull().sum()

Loan_ID            0
Married            3
Dependents        15
Education          0
Self_Employed     32
Property_Area      0
Loan_Status        0
Credit_History    50
dtype: int64

In [24]:
# Delete all columns with null values
total_categorical_data_6 = total_categorical_data.drop(cat_variables_with_missing_val,axis=1)
total_categorical_data_6.isnull().sum()

Loan_ID          0
Education        0
Property_Area    0
Loan_Status      0
dtype: int64

In [25]:
# Delete column with a percentage of nan threshold
# In most cases we delete column when it is irrelevant to business objective and have more than 80% missing values
# In my delete_row_with_cond data, I have 4 columns with over 30% missing values
# I want to list these columns and then remove them from dataset
columns_with_missing_30 = delete_row_with_cond.columns[delete_row_with_cond.isnull().mean() > 0.3]
print(columns_with_missing_30)

# Now, we want to remove them from the dataset and remain with columns missings are less than 30%
less_than_30_per_missing = delete_row_with_cond[delete_row_with_cond.columns[delete_row_with_cond.isnull().mean() < 0.3]]
less_than_30_per_missing

Index(['Region_t_p', 'Name_t_p', 'Item_t_p', 'Units'], dtype='object')

   Number Order Date  Unit Cost   Total
0       1     1 6 19       1.99  189.05
1       2    1 23 19      19.99  999.50
2       3     2 9 19        NaN  179.64
3       4    2 26 19      19.99  539.73
4       5        NaN       2.99  167.44
5       7    4 18 19       1.99  149.25
6       9        NaN       1.99   63.68
7      10     6 8 19       8.99     NaN

## b) Imputation
>We impute with most frequent value. this is common with categorical variables.
>
>Assumptions: Data is Missing At Random (MAR) and missing values look like the majority.

>Description: Replacing NAN values with the most frequent occurred category in variable/column.

>Implementation:

>Step 1: Find which category occurred most in each category using mode().

>Step 2: Replace all NAN values in that column with that category.

>Step 3: Check the dataset for missing values

>If the number of missing values in a category are less than 10% and other classes are normally distributed then replace missing values with mode of the variable. But is number of missing values are high then its better to treat it as one more value in that category i.e. replace it with 0 value.

In [46]:
# Checking out missing values
create_missing_values_table(total_categorical_data)

Your selected dataframe has 9 columns.
There are 5 columns that have missing values.

                Missing Values  % of Total Values
Credit_History              50                8.1
Self_Employed               32                5.2
Dependents                  15                2.4
Gender                      13                2.1
Married                      3                0.5

### Fill with most frequent values for a single column

In [27]:
# Check the distribution of categories
print(total_categorical_data['Credit_History'].value_counts())

Credit_History
1.0    475
0.0     89
Name: count, dtype: int64

In [32]:
# It can be seen that 1 occurs the most times in the credit history column
# Let’s impute the missing values using the strategy as most_frequent


# Make a copy of your dataset
total_categorical_data3 = total_categorical_data.copy()

# Replace the missing value with '0' using 'fiilna' method
total_categorical_data3['Credit_History']= total_categorical_data3['Credit_History'].fillna(total_categorical_data3['Credit_History'].mode()[0])

print("===================================================================================================")
print ("Your selected column has " + str(total_categorical_data["Credit_History"].isnull().sum()) + " null values.\n"      
            "After handling with most frequent value fill, there are " + str(total_categorical_data3["Credit_History"].isnull().sum()) +
              " missing values.")
print("===================================================================================================")

===================================================================================================
Your selected column has 50 null values.
After handling with most frequent value fill, there are 0 missing values.
===================================================================================================

### Fill with most frequent values for all columns

In [34]:
# It can be seen that 1 occurs the most times in the credit history column
# It can be seen that No occurs the most times in the Self-employed column and so on.
# Let’s impute the missing values using the strategy as most_frequent

# Create a copy of dataset
total_categorical_data_mode = total_categorical_data.copy()

# Model Creation
imputer = SimpleImputer(strategy ='most_frequent')

# fitting the imputer on the original dataset
imputer.fit(total_categorical_data_mode)

# Imputing the missing values in train, validation and test inputs
total_categorical_data_mode=imputer.transform(total_categorical_data_mode)

In [44]:
# Get the entire columns of the dataset
columns = list(total_categorical_data)
columns

['Loan_ID',
 'Gender',
 'Married',
 'Dependents',
 'Education',
 'Self_Employed',
 'Property_Area',
 'Loan_Status',
 'Credit_History']

In [43]:
# Now let’s see the number of missing values in the train_inputs after imputation
# Using pd.DataFrame()
total_categorical_data_mode_df = pd.DataFrame(total_categorical_data_mode, columns = columns)

In [45]:
# Checking null values with function created above
create_missing_values_table(total_categorical_data_mode_df)

Your selected dataframe has 9 columns.
There are 0 columns that have missing values.

Empty DataFrame
Columns: [Missing Values, % of Total Values]
Index: []

***Advantage***: Simple and easy to implement for categorical variables/columns.

***Disadvantage***:

- Features having a max number of null values may bias prediction if replace with the most occurred category.
- It distorts the relation of the most frequent label.

## c) Use separate category for missing values

>This involves creating a new category specifically for missing values. This can be useful if the missing values have some meaningful interpretation.
>This approach allows us to preserve the original data without distorting the existing categories. For example, we could assign the category ‘Unknown’ to represent missing values.

In [48]:
# Checking out missing values
create_missing_values_table(total_categorical_data)

Your selected dataframe has 9 columns.
There are 5 columns that have missing values.

                Missing Values  % of Total Values
Credit_History              50                8.1
Self_Employed               32                5.2
Dependents                  15                2.4
Gender                      13                2.1
Married                      3                0.5

In [49]:
# For example if we realized that the respondents who have not filled out the gender variable are
# Those who preferred not to disclose their gender, and infact, we are interested in their characteristics
# In such cases, instead of filling the missing values with most frequent response, we use a different category
# For this demo, we use "prefer not to say" for the gender missing values.

In [55]:
# Check gender data with null values
# You might find something interesting
filtered_df = total_categorical_data[total_categorical_data['Gender'].isnull()] # if you want not null use .notnull
filtered_df

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,Property_Area,Loan_Status,Credit_History
23,LP001050,NaN,Yes,2,Not Graduate,No,Rural,N,0.0
126,LP001448,NaN,Yes,3+,Graduate,No,Rural,Y,1.0
171,LP001585,NaN,Yes,3+,Graduate,No,Urban,Y,1.0
188,LP001644,NaN,Yes,0,Graduate,Yes,Rural,Y,1.0
314,LP002024,NaN,Yes,0,Graduate,No,Rural,N,1.0
334,LP002103,NaN,Yes,1,Graduate,Yes,Urban,Y,1.0
460,LP002478,NaN,Yes,0,Graduate,Yes,Semiurban,Y,NaN
467,LP002501,NaN,Yes,0,Graduate,No,Semiurban,Y,1.0
477,LP002530,NaN,Yes,2,Graduate,No,Semiurban,N,0.0
507,LP002625,NaN,No,0,Graduate,No,Urban,N,1.0
576,LP002872,NaN,Yes,0,Graduate,No,Semiurban,N,0.0
588,LP002925,NaN,No,0,Graduate,No,Semiurban,Y,1.0
592,LP002933,NaN,No,3+,Graduate,Yes,Semiurban,Y,1.0

In [56]:
# For this case, where we are filling only one column, I don't see a need to use SimpleImputer
# Which is perfect when we impute entire missing values in the dataset. Instead,

# Make a copy of your dataset
total_categorical_data_4 = total_categorical_data.copy()

# Replace the missing value with '0' using 'fiilna' method
total_categorical_data_4["Gender"] = total_categorical_data_4["Gender"].fillna("Prefer not to say")

print("===================================================================================================")
print ("Your selected column has " + str(total_categorical_data["Gender"].isnull().sum()) + " null values.\n"      
            "After handling with abitrary value fill, there are " + str(total_categorical_data_4["Gender"].isnull().sum()) +
              " missing values.")
print("===================================================================================================")

===================================================================================================
Your selected column has 13 null values.
After handling with abitrary value fill, there are 0 missing values.
===================================================================================================

In [57]:
# As you may have thought, we have created a new category of respondents who might show a different character
# The individuals who are not ready to disclose their gender are equal to previous missing values = 13
total_categorical_data_4["Gender"].value_counts()

Gender
Male                 489
Female               112
Prefer not to say     13
Name: count, dtype: int64

## d) Use multiple imputation
> ### KNN Imputer
>This imputer utilizes the k-Nearest Neighbors method to replace the missing values in the datasets with the mean value from the parameter ‘n_neighbors’ nearest neighbors found in the training set.
By default, it uses a Euclidean distance metric to impute the missing values
>
> For this imputation, we first need to perform encoding as does not recognize text data values and will throw error if we do not change these values to numerical values. I am doing mapping, you can also go with LabelEncoding or OneHotEncoding.
>

### KNN Imputer for single variable

### KNN Imputer for multiple variables

## e) Mix these techniques for one dataset

## Conclusion
> Well, there is no single best way to handle missing values. One needs to experiment with different methods and then decide which method is best for a particular problem.

## References and good resources
> - https://campus.datacamp.com/courses/dealing-with-missing-data-in-python/the-problem-with-missing-data?ex=1
> - https://towardsdatascience.com/how-to-handle-missing-data-8646b18db0d4